alplabai/gd32-bridge-firmware/src/protocol.c
/*
 * Copyright 2026 Alp Lab AB
 * SPDX-License-Identifier: Apache-2.0
 *
 * gd32-bridge firmware: shared command-handler table.
 *
 * Per the project memory rule "don't fork the protocol -- one framing
 * format, one command set, one set of reply codes; only the transport
 * layer differs", both the SPI and I2C transports call into this
 * file's protocol_dispatch().
 *
 * Handlers that need actual hardware (PWM channel programming, ADC
 * sampling, GPIO output, DA9292 INT/TW pin sampling) currently call
 * into the `bridge_hw_*` HAL shims declared in hal/.  The HAL is a
 * separate compile unit and will be implemented against the GigaDevice
 * firmware library in a follow-up commit.  Today those shims return
 * STATUS_NOSUPPORT so the protocol round-trip is exercisable
 * end-to-end (PING + GET_VERSION + GET_BUILD_ID work without any
 * peripheral I/O).
 */

#include <string.h>

#include "protocol.h"
#include "../hal/bridge_hw.h"
#include "bootloader/bootloader.h"

/* --------------------------------------------------------------- */
/* CRC-16 / CCITT-FALSE -- shared with transports.                   */
/* --------------------------------------------------------------- */

uint16_t crc16_ccitt_false(const uint8_t *buf, size_t len)
{
	uint16_t crc = 0xFFFFu;
	for (size_t i = 0; i < len; ++i) {
		crc ^= (uint16_t)buf[i] << 8;
		for (unsigned b = 0; b < 8; ++b) {
			if (crc & 0x8000u) {
				crc = (uint16_t)((crc << 1) ^ 0x1021u);
			} else {
				crc <<= 1;
			}
		}
	}
	return crc;
}

/* --------------------------------------------------------------- */
/* Build identifier: "<fw-version>+<git-sha-prefix>", 20 ASCII chars. */
/* Baked at build time into the generated gd32_bridge_build_id.h by  */
/* cmake/gen_build_id.cmake (re-run every build, so HEAD moves and   */
/* version bumps land in the next incremental build).  Non-CMake     */
/* consumers (the SDK-side transport unit tests compile this file    */
/* directly) keep the hermetic placeholder below.                     */
/* --------------------------------------------------------------- */

#ifdef GD32_BRIDGE_HAVE_BUILD_ID_HEADER
#include "gd32_bridge_build_id.h"
#endif

#ifndef GD32_BRIDGE_BUILD_ID
#define GD32_BRIDGE_BUILD_ID "0000000000000000abcd"
#endif

_Static_assert(sizeof(GD32_BRIDGE_BUILD_ID) - 1u == GD32_BRIDGE_BUILD_ID_LEN,
               "build id must be 20 ASCII bytes");

/* --------------------------------------------------------------- */
/* LE-int helpers (firmware side, parallel to the host driver).      */
/* --------------------------------------------------------------- */

static uint32_t get_le32(const uint8_t *p)
{
	return (uint32_t)p[0] | ((uint32_t)p[1] << 8) | ((uint32_t)p[2] << 16) | ((uint32_t)p[3] << 24);
}

static void put_le32(uint8_t *p, uint32_t v)
{
	p[0] = (uint8_t)(v & 0xFFu);
	p[1] = (uint8_t)((v >> 8) & 0xFFu);
	p[2] = (uint8_t)((v >> 16) & 0xFFu);
	p[3] = (uint8_t)((v >> 24) & 0xFFu);
}

/* --------------------------------------------------------------- */
/* Per-opcode handlers                                                */
/* --------------------------------------------------------------- */

static gd32_bridge_status_t
handle_ping(const uint8_t *req, size_t req_len, uint8_t *reply, size_t reply_cap, size_t *reply_len)
{
	(void)req;
	(void)reply;
	(void)reply_cap;
	if (req_len != 0u) return STATUS_INVAL;
	*reply_len = 0u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_get_version(const uint8_t *req,
                                               size_t         req_len,
                                               uint8_t       *reply,
                                               size_t         reply_cap,
                                               size_t        *reply_len)
{
	(void)req;
	if (req_len != 0u) return STATUS_INVAL;
	if (reply_cap < 3u) return STATUS_NOMEM;
	reply[0]   = PROTOCOL_VERSION_MAJOR;
	reply[1]   = PROTOCOL_VERSION_MINOR;
	reply[2]   = PROTOCOL_VERSION_PATCH;
	*reply_len = 3u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_get_build_id(const uint8_t *req,
                                                size_t         req_len,
                                                uint8_t       *reply,
                                                size_t         reply_cap,
                                                size_t        *reply_len)
{
	(void)req;
	if (req_len != 0u) return STATUS_INVAL;
	if (reply_cap < GD32_BRIDGE_BUILD_ID_LEN) return STATUS_NOMEM;
	memcpy(reply, GD32_BRIDGE_BUILD_ID, GD32_BRIDGE_BUILD_ID_LEN);
	*reply_len = GD32_BRIDGE_BUILD_ID_LEN;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_reset_reason(const uint8_t *req,
                                                size_t         req_len,
                                                uint8_t       *reply,
                                                size_t         reply_cap,
                                                size_t        *reply_len)
{
	(void)req;
	if (req_len != 0u) return STATUS_INVAL;
	if (reply_cap < 1u) return STATUS_NOMEM;
	/* bridge_hw_reset_reason() also clears the cause on read so the
     * next caller sees UNKNOWN if no further resets have happened. */
	reply[0]   = bridge_hw_reset_reason();
	*reply_len = 1u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_gpio_read(const uint8_t *req,
                                             size_t         req_len,
                                             uint8_t       *reply,
                                             size_t         reply_cap,
                                             size_t        *reply_len)
{
	if (req_len != 4u) return STATUS_INVAL;
	if (reply_cap < 4u) return STATUS_NOMEM;
	const uint32_t mask   = get_le32(req);
	uint32_t       levels = 0u;
	const int      rv     = bridge_hw_gpio_read(mask, &levels);
	if (rv < 0) return STATUS_IO;
	put_le32(reply, levels);
	*reply_len = 4u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_gpio_write(const uint8_t *req,
                                              size_t         req_len,
                                              uint8_t       *reply,
                                              size_t         reply_cap,
                                              size_t        *reply_len)
{
	(void)reply;
	(void)reply_cap;
	if (req_len != 8u) return STATUS_INVAL;
	const uint32_t mask   = get_le32(&req[0]);
	const uint32_t levels = get_le32(&req[4]);
	const int      rv     = bridge_hw_gpio_write(mask, levels);
	if (rv < 0) return STATUS_IO;
	*reply_len = 0u;
	return STATUS_OK;
}

