alplabai/gd32-bridge-firmware/src/protocol.c
static gd32_bridge_status_t handle_pwm_set(const uint8_t *req,
                                           size_t         req_len,
                                           uint8_t       *reply,
                                           size_t         reply_cap,
                                           size_t        *reply_len)
{
	(void)reply;
	(void)reply_cap;
	if (req_len != 10u) return STATUS_INVAL;
	const uint8_t channel = req[0];
	/* req[1] is the reserved padding byte; ignore */
	const uint32_t period_ns = get_le32(&req[2]);
	const uint32_t duty_ns   = get_le32(&req[6]);
	if (duty_ns > period_ns) return STATUS_INVAL;
	const int rv = bridge_hw_pwm_set(channel, period_ns, duty_ns);
	if (rv == BRIDGE_HW_ERR_RANGE) return STATUS_OUT_OF_RANGE;
	if (rv == BRIDGE_HW_ERR_INVAL) return STATUS_INVAL;
	if (rv < 0) return STATUS_IO;
	*reply_len = 0u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_pwm_get(const uint8_t *req,
                                           size_t         req_len,
                                           uint8_t       *reply,
                                           size_t         reply_cap,
                                           size_t        *reply_len)
{
	if (req_len != 1u) return STATUS_INVAL;
	if (reply_cap < 8u) return STATUS_NOMEM;
	uint32_t  period_ns = 0u;
	uint32_t  duty_ns   = 0u;
	const int rv        = bridge_hw_pwm_get(req[0], &period_ns, &duty_ns);
	if (rv == BRIDGE_HW_ERR_INVAL) return STATUS_INVAL;
	if (rv < 0) return STATUS_IO;
	put_le32(&reply[0], period_ns);
	put_le32(&reply[4], duty_ns);
	*reply_len = 8u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_adc_read(const uint8_t *req,
                                            size_t         req_len,
                                            uint8_t       *reply,
                                            size_t         reply_cap,
                                            size_t        *reply_len)
{
	if (req_len != 2u) return STATUS_INVAL;
	uint8_t channel = req[0];
	uint8_t samples = req[1];
	if (samples == 0u) return STATUS_INVAL;
	/* Reject out-of-range sample counts outright rather than silently
     * capping -- the host driver compares `reply[0]` against the
     * originally-requested count and treats a mismatch as a wire
     * error, so silent capping would turn a documented OUT_OF_RANGE
     * caller error into a misleading ALP_ERR_IO. */
	if (samples > GD32_BRIDGE_ADC_MAX_SAMPLES) return STATUS_OUT_OF_RANGE;

	const size_t need = 1u + (size_t)samples * 2u;
	if (reply_cap < need) return STATUS_NOMEM;

	reply[0] = samples; /* echoes back the (validated) value */
	uint16_t  mv[GD32_BRIDGE_ADC_MAX_SAMPLES];
	const int rv = bridge_hw_adc_read(channel, samples, mv);
	if (rv == BRIDGE_HW_ERR_INVAL) return STATUS_INVAL;
	if (rv < 0) return STATUS_IO;
	for (uint8_t i = 0u; i < samples; ++i) {
		reply[1u + i * 2u]      = (uint8_t)(mv[i] & 0xFFu);
		reply[1u + i * 2u + 1u] = (uint8_t)((mv[i] >> 8) & 0xFFu);
	}
	*reply_len = need;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_da9292_forward(const uint8_t *req,
                                                  size_t         req_len,
                                                  uint8_t       *reply,
                                                  size_t         reply_cap,
                                                  size_t        *reply_len)
{
	(void)req;
	if (req_len != 0u) return STATUS_INVAL;
	if (reply_cap < 1u) return STATUS_NOMEM;
	reply[0]   = bridge_hw_da9292_status_cached();
	*reply_len = 1u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_se_reset(const uint8_t *req,
                                            size_t         req_len,
                                            uint8_t       *reply,
                                            size_t         reply_cap,
                                            size_t        *reply_len)
{
	(void)reply;
	(void)reply_cap;
	if (req_len != 1u) return STATUS_INVAL;
	if (req[0] > 1u) return STATUS_INVAL; /* assert ∈ {0 = release, 1 = hold} */
	const int rv = bridge_hw_se_reset(req[0]);
	if (rv == BRIDGE_HW_ERR_INVAL) return STATUS_INVAL;
	if (rv == BRIDGE_HW_ERR_NOTIMPL) return STATUS_NOSUPPORT;
	if (rv < 0) return STATUS_IO;
	*reply_len = 0u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_dac_set(const uint8_t *req,
                                           size_t         req_len,
                                           uint8_t       *reply,
                                           size_t         reply_cap,
                                           size_t        *reply_len)
{
	(void)reply;
	(void)reply_cap;
	if (req_len != 4u) return STATUS_INVAL;
	const uint8_t channel = req[0];
	/* req[1] reserved padding -- ignore */
	const uint16_t value_mv = (uint16_t)req[2] | ((uint16_t)req[3] << 8);
	const int      rv       = bridge_hw_dac_set(channel, value_mv);
	if (rv == BRIDGE_HW_ERR_INVAL) return STATUS_INVAL;
	if (rv == BRIDGE_HW_ERR_RANGE) return STATUS_OUT_OF_RANGE;
	if (rv == BRIDGE_HW_ERR_NOTIMPL) return STATUS_NOSUPPORT;
	if (rv < 0) return STATUS_IO;
	*reply_len = 0u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_dac_get(const uint8_t *req,
                                           size_t         req_len,
                                           uint8_t       *reply,
                                           size_t         reply_cap,
                                           size_t        *reply_len)
{
	if (req_len != 1u) return STATUS_INVAL;
	if (reply_cap < 2u) return STATUS_NOMEM;
	uint16_t  value_mv = 0u;
	const int rv       = bridge_hw_dac_get(req[0], &value_mv);
	if (rv == BRIDGE_HW_ERR_INVAL) return STATUS_INVAL;
	if (rv == BRIDGE_HW_ERR_NOTIMPL) return STATUS_NOSUPPORT;
	if (rv < 0) return STATUS_IO;
	reply[0]   = (uint8_t)(value_mv & 0xFFu);
	reply[1]   = (uint8_t)((value_mv >> 8) & 0xFFu);
	*reply_len = 2u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_qenc_read(const uint8_t *req,
                                             size_t         req_len,
                                             uint8_t       *reply,
                                             size_t         reply_cap,
                                             size_t        *reply_len)
{
	if (req_len != 1u) return STATUS_INVAL;
	if (reply_cap < 4u) return STATUS_NOMEM;
	int32_t   position = 0;
	const int rv       = bridge_hw_qenc_read(req[0], &position);
	if (rv == BRIDGE_HW_ERR_INVAL) return STATUS_INVAL;
	if (rv == BRIDGE_HW_ERR_NOTIMPL) return STATUS_NOSUPPORT;
	if (rv < 0) return STATUS_IO;
	put_le32(reply, (uint32_t)position);
	*reply_len = 4u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_qenc_reset(const uint8_t *req,
                                              size_t         req_len,
                                              uint8_t       *reply,
                                              size_t         reply_cap,
                                              size_t        *reply_len)
{
	(void)reply;
	(void)reply_cap;
	if (req_len != 1u) return STATUS_INVAL;
	const int rv = bridge_hw_qenc_reset(req[0]);
	if (rv == BRIDGE_HW_ERR_INVAL) return STATUS_INVAL;
	if (rv == BRIDGE_HW_ERR_NOTIMPL) return STATUS_NOSUPPORT;
	if (rv < 0) return STATUS_IO;
	*reply_len = 0u;
	return STATUS_OK;
}

