alplabai/gd32-bridge-firmware/src/protocol.c
static gd32_bridge_status_t handle_counter_read(const uint8_t *req,
                                                size_t         req_len,
                                                uint8_t       *reply,
                                                size_t         reply_cap,
                                                size_t        *reply_len)
{
	if (req_len != 1u) return STATUS_INVAL;
	if (reply_cap < 4u) return STATUS_NOMEM;
	uint32_t  ticks = 0u;
	const int rv    = bridge_hw_counter_read(req[0], &ticks);
	if (rv == BRIDGE_HW_ERR_INVAL) return STATUS_INVAL;
	if (rv == BRIDGE_HW_ERR_NOTIMPL) return STATUS_NOSUPPORT;
	if (rv < 0) return STATUS_IO;
	put_le32(reply, ticks);
	*reply_len = 4u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_pwm_configure(const uint8_t *req,
                                                 size_t         req_len,
                                                 uint8_t       *reply,
                                                 size_t         reply_cap,
                                                 size_t        *reply_len)
{
	(void)reply;
	(void)reply_cap;
	if (req_len != 7u) return STATUS_INVAL;
	const uint8_t  channel      = req[0];
	const uint8_t  align_mode   = req[1];
	const uint32_t dead_time_ns = get_le32(&req[2]);
	const uint8_t  break_cfg    = req[6];
	if (align_mode > 3u) return STATUS_INVAL;
	const int rv = bridge_hw_pwm_configure(channel, align_mode, dead_time_ns, break_cfg);
	if (rv == BRIDGE_HW_ERR_INVAL) return STATUS_INVAL;
	if (rv == BRIDGE_HW_ERR_RANGE) return STATUS_OUT_OF_RANGE;
	if (rv == BRIDGE_HW_ERR_NOTIMPL) return STATUS_NOSUPPORT;
	if (rv < 0) return STATUS_IO;
	*reply_len = 0u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_adc_configure(const uint8_t *req,
                                                 size_t         req_len,
                                                 uint8_t       *reply,
                                                 size_t         reply_cap,
                                                 size_t        *reply_len)
{
	(void)reply;
	(void)reply_cap;
	if (req_len != 7u) return STATUS_INVAL;
	const uint8_t channel = req[0];
	/* req[1] reserved padding */
	const uint16_t oversample_ratio = (uint16_t)req[2] | ((uint16_t)req[3] << 8);
	const uint16_t sample_cycles    = (uint16_t)req[4] | ((uint16_t)req[5] << 8);
	const uint8_t  resolution_bits  = req[6];
	/* Resolution is one of 6/8/10/12/14/16 per the GD32G5
     * datasheet's effective-resolution table; the firmware rejects
     * other values rather than silently rounding so callers find
     * out at protocol time. */
	switch (resolution_bits) {
	case 0u: /* "use the firmware default" */
	case 6u:
	case 8u:
	case 10u:
	case 12u:
	case 14u:
	case 16u:
		break;
	default:
		return STATUS_INVAL;
	}
	const int rv =
	    bridge_hw_adc_configure(channel, oversample_ratio, sample_cycles, resolution_bits);
	if (rv == BRIDGE_HW_ERR_INVAL) return STATUS_INVAL;
	if (rv == BRIDGE_HW_ERR_RANGE) return STATUS_OUT_OF_RANGE;
	if (rv == BRIDGE_HW_ERR_NOTIMPL) return STATUS_NOSUPPORT;
	if (rv < 0) return STATUS_IO;
	*reply_len = 0u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_adc_stream_begin(const uint8_t *req,
                                                    size_t         req_len,
                                                    uint8_t       *reply,
                                                    size_t         reply_cap,
                                                    size_t        *reply_len)
{
	(void)reply;
	(void)reply_cap;
	if (req_len != 7u) return STATUS_INVAL;
	const uint8_t stream_id = req[0];
	const uint8_t channel   = req[1];
	/* req[2] reserved padding */
	const uint32_t sample_rate_hz = get_le32(&req[3]);
	if (stream_id >= GD32_BRIDGE_ADC_STREAM_COUNT) return STATUS_INVAL;
	if (sample_rate_hz == 0u) return STATUS_INVAL;
	const int rv = bridge_hw_adc_stream_begin(stream_id, channel, sample_rate_hz);
	if (rv == BRIDGE_HW_ERR_INVAL) return STATUS_INVAL;
	if (rv == BRIDGE_HW_ERR_RANGE) return STATUS_OUT_OF_RANGE;
	if (rv == BRIDGE_HW_ERR_NOTIMPL) return STATUS_NOSUPPORT;
	if (rv < 0) return STATUS_IO;
	*reply_len = 0u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_adc_stream_read(const uint8_t *req,
                                                   size_t         req_len,
                                                   uint8_t       *reply,
                                                   size_t         reply_cap,
                                                   size_t        *reply_len)
{
	if (req_len != 2u) return STATUS_INVAL;
	const uint8_t stream_id   = req[0];
	uint8_t       max_samples = req[1];
	if (stream_id >= GD32_BRIDGE_ADC_STREAM_COUNT) return STATUS_INVAL;
	/* The wire-framing layer needs a fixed reply length so the host
     * can clock the right number of bytes.  Reply is always
     * `1 + max_samples*2` bytes: byte 0 = `got` (the valid sample
     * count, 0..max_samples); subsequent bytes are the sample data,
     * with trailing slots zero-padded when the firmware ring had
     * fewer than `max_samples` samples ready. */
	if (max_samples == 0u) return STATUS_INVAL;
	if (max_samples > GD32_BRIDGE_ADC_STREAM_READ_MAX) {
		return STATUS_OUT_OF_RANGE;
	}

	/* Reply scratch on the firmware stack -- avoid pulling in the
     * full GD32_BRIDGE_MAX_PAYLOAD_BYTES buffer.  Sized to the
     * stream-read ceiling. */
	uint16_t  mv[GD32_BRIDGE_ADC_STREAM_READ_MAX];
	uint8_t   got = 0u;
	const int rv  = bridge_hw_adc_stream_read(stream_id, max_samples, &got, mv);
	if (rv == BRIDGE_HW_ERR_NOTIMPL) return STATUS_NOSUPPORT;
	/* Ring overrun (the DMA writer lapped the host's read cursor):
     * the documented wire answer is STATUS_BUSY -- "host should poll
     * faster" (docs/gd32-bridge-protocol.md §3.10).  The HAL has
     * already dropped the corrupt backlog and resynced its cursor,
     * so the next READ returns fresh samples. */
	if (rv == BRIDGE_HW_ERR_BUSY) return STATUS_BUSY;
	if (rv < 0) return STATUS_IO;
	if (got > max_samples) return STATUS_IO; /* HAL contract violation */

