alplabai/gd32-bridge-firmware/src/protocol.c
static gd32_bridge_status_t handle_adc_dsp_chain_open(const uint8_t *req,
                                                      size_t         req_len,
                                                      uint8_t       *reply,
                                                      size_t         reply_cap,
                                                      size_t        *reply_len)
{
	(void)req;
	if (req_len != 0u) return STATUS_INVAL;
	if (reply_cap < 1u) return STATUS_NOMEM;
	uint8_t                    chain_id = 0u;
	const int                  rv       = bridge_hw_adc_dsp_chain_open(&chain_id);
	const gd32_bridge_status_t s        = status_from_hw(rv);
	if (s != STATUS_OK) {
		*reply_len = 0u;
		return s;
	}
	reply[0]   = chain_id;
	*reply_len = 1u;
	return STATUS_OK;
}

static gd32_bridge_status_t handle_adc_dsp_stage_push(const uint8_t *req,
                                                      size_t         req_len,
                                                      uint8_t       *reply,
                                                      size_t         reply_cap,
                                                      size_t        *reply_len)
{
	(void)reply;
	(void)reply_cap;
	/* Header is 7 bytes: chain_id, stage_index, kind, chunk_offset:u16,
     * chunk_total_size:u16.  chunk_data follows at req[7..req_len). */
	if (req_len < 7u) return STATUS_INVAL;
	if (req[2] > 3u) return STATUS_INVAL; /* kind ∈ {FIR, IIR, WINDOW, FFT} */
	const uint8_t  chain_id         = req[0];
	const uint8_t  stage_index      = req[1];
	const uint8_t  kind             = req[2];
	const uint16_t chunk_offset     = (uint16_t)req[3] | ((uint16_t)req[4] << 8);
	const uint16_t chunk_total_size = (uint16_t)req[5] | ((uint16_t)req[6] << 8);
	const size_t   chunk_data_len   = req_len - 7u;
	const uint8_t *chunk_data       = (chunk_data_len > 0u) ? &req[7] : (const uint8_t *)0;
	/* Defence-in-depth: chunk_data + chunk_offset must stay within the
     * declared chunk_total_size.  The host helper already enforces
     * this, but firmware re-checks so a malformed wire request can't
     * walk past the per-stage scratch buffer. */
	if ((uint32_t)chunk_offset + (uint32_t)chunk_data_len > (uint32_t)chunk_total_size) {
		return STATUS_OUT_OF_RANGE;
	}
	const int rv = bridge_hw_adc_dsp_stage_push(
	    chain_id, stage_index, kind, chunk_offset, chunk_total_size, chunk_data, chunk_data_len);
	*reply_len = 0u;
	return status_from_hw(rv);
}

static gd32_bridge_status_t handle_adc_dsp_chain_bind(const uint8_t *req,
                                                      size_t         req_len,
                                                      uint8_t       *reply,
                                                      size_t         reply_cap,
                                                      size_t        *reply_len)
{
	(void)reply;
	(void)reply_cap;
	if (req_len != 2u) return STATUS_INVAL;
	if (req[1] >= GD32_BRIDGE_ADC_STREAM_COUNT) return STATUS_INVAL;
	const int rv = bridge_hw_adc_dsp_chain_bind(req[0], req[1]);
	*reply_len   = 0u;
	return status_from_hw(rv);
}

/* --------------------------------------------------------------- */
/* v0.7 -- link-feature negotiation                                  */
/* --------------------------------------------------------------- */

/* Armed link features (GD32_BRIDGE_LINK_FEAT_*).  Lives here rather
 * than in a transport because the negotiation command can arrive over
 * either transport; the SPI transport consults the accessor when it
 * stages replies (the I2C transport never stamps -- STATUS_NO_PENDING
 * owns bit 7 there).  Reset default: everything off = the pre-v0.7
 * wire, so an un-negotiated link is byte-identical to older firmware. */
static uint8_t link_features;

uint8_t protocol_link_features(void)
{
	return link_features;
}

static gd32_bridge_status_t handle_link_features(const uint8_t *req,
                                                 size_t         req_len,
                                                 uint8_t       *reply,
                                                 size_t         reply_cap,
                                                 size_t        *reply_len)
{
	if (req_len != 1u) return STATUS_INVAL;
	if (reply_cap < 1u) return STATUS_NOMEM;
	/* Grant the intersection of the request with what this firmware
     * implements, and arm it IMMEDIATELY -- the reply to this very
     * command already rides the new framing (the host treats its
     * stamp as the sequence baseline).  A request of 0 disables
     * everything; idempotent in both directions. */
	link_features = (uint8_t)(req[0] & GD32_BRIDGE_LINK_FEAT_STATUS_SEQ);
	reply[0]      = link_features;
	*reply_len    = 1u;
	return STATUS_OK;
}

/* --------------------------------------------------------------- */
/* Dispatch                                                          */
/* --------------------------------------------------------------- */

typedef gd32_bridge_status_t (*cmd_handler_t)(const uint8_t *, size_t, uint8_t *, size_t, size_t *);

/* Two-tier dispatch: a sparse switch on opcode keeps the table size
 * small (vs a dense 256-entry array) without losing the "one handler
 * table" property. */
gd32_bridge_status_t protocol_dispatch(uint8_t        cmd,
                                       const uint8_t *req_payload,
                                       size_t         req_payload_len,
                                       uint8_t       *reply_payload,
                                       size_t         reply_payload_cap,
                                       size_t        *reply_payload_len)
{
	cmd_handler_t h = NULL;
	switch (cmd) {
	case CMD_PING:
		h = handle_ping;
		break;
	case CMD_GET_VERSION:
		h = handle_get_version;
		break;
	case CMD_GET_BUILD_ID:
		h = handle_get_build_id;
		break;
	case CMD_RESET_REASON:
		h = handle_reset_reason;
		break;
	case CMD_GPIO_READ:
		h = handle_gpio_read;
		break;
	case CMD_GPIO_WRITE:
		h = handle_gpio_write;
		break;
	case CMD_PWM_SET:
		h = handle_pwm_set;
		break;
	case CMD_PWM_GET:
		h = handle_pwm_get;
		break;
	case CMD_PWM_CONFIGURE:
		h = handle_pwm_configure;
		break;
	case CMD_ADC_READ:
		h = handle_adc_read;
		break;
	case CMD_ADC_CONFIGURE:
		h = handle_adc_configure;
		break;
	case CMD_ADC_STREAM_BEGIN:
		h = handle_adc_stream_begin;
		break;
	case CMD_ADC_STREAM_READ:
		h = handle_adc_stream_read;
		break;
	case CMD_ADC_STREAM_END:
		h = handle_adc_stream_end;
		break;
	case CMD_ADC_SPECTRUM_READ:
		h = handle_adc_spectrum_read;
		break;
	case CMD_TRNG_READ:
		h = handle_trng_read;
		break;
	case CMD_TMU_COMPUTE:
		h = handle_tmu_compute;
		break;
	case CMD_DA9292_STATUS_FORWARD:
		h = handle_da9292_forward;
		break;
	case CMD_SE_RESET:
		h = handle_se_reset;
		break;
	case CMD_DAC_SET:
		h = handle_dac_set;
		break;
	case CMD_DAC_GET:
		h = handle_dac_get;
		break;
	case CMD_QENC_READ:
		h = handle_qenc_read;
		break;
	case CMD_QENC_RESET:
		h = handle_qenc_reset;
		break;
	case CMD_COUNTER_READ:
		h = handle_counter_read;
		break;
	/* v0.5 (§2B.2) advanced timer extras + (§2B.3) power-mode set.
     * Real bodies in hal/gd32/ (pwm_capture.c / pwm.c / timer_sync.c /
     * power.c); the stub backend answers STATUS_NOSUPPORT. */
	case CMD_PWM_CAPTURE_BEGIN:
		h = handle_pwm_capture_begin;
		break;
	case CMD_PWM_CAPTURE_READ:
		h = handle_pwm_capture_read;
		break;
	case CMD_PWM_CAPTURE_END:
		h = handle_pwm_capture_end;
		break;
	case CMD_PWM_SINGLE_PULSE:
		h = handle_pwm_single_pulse;
		break;
	case CMD_TIMER_SYNC:
		h = handle_timer_sync;
		break;
	case CMD_POWER_MODE_SET:
		h = handle_power_mode_set;
		break;
	case CMD_LINK_FEATURES:
		h = handle_link_features;
		break;
	/* v0.5 (§2B wave-2) chunked DSP-chain upload (CHAIN_OPEN /
     * STAGE_PUSH / CHAIN_BIND).  The 0x36 tombstone stays in the
     * default branch -- host code SHOULD NOT call it, and any
     * residual caller gets STATUS_NOSUPPORT from the fallthrough. */
	case CMD_ADC_DSP_CHAIN_OPEN:
		h = handle_adc_dsp_chain_open;
		break;
	case CMD_ADC_DSP_STAGE_PUSH:
		h = handle_adc_dsp_stage_push;
		break;
	case CMD_ADC_DSP_CHAIN_BIND:
		h = handle_adc_dsp_chain_bind;
		break;
	default:
		/* Route the reserved OTA opcode range (0xF0..0xFF) through
         * the application bootloader's dispatcher.  Bodies return
         * STATUS_NOSUPPORT until the FMC HAL lands -- see
         * src/bootloader/.  `cmd` is uint8_t so the upper bound 0xFFu
         * is implicit; explicit check would trip -Wtype-limits. */
		if (cmd >= CMD_OTA_BEGIN) {
			return bl_dispatch_ota(cmd,
			                       req_payload,
			                       req_payload_len,
			                       reply_payload,
			                       reply_payload_cap,
			                       reply_payload_len);
		}
		*reply_payload_len = 0u;
		return STATUS_NOSUPPORT;
	}
	return h(req_payload, req_payload_len, reply_payload, reply_payload_cap, reply_payload_len);
}
